[{"id":"577bbbde799445a12d969753","slug":"day-1-xyz-team-rgsoc-2016-kickoff-day","title":"Day 1 - XYZ team RGSoC 2016 kickoff day","state":"Published","author":"{\"id\":\"577b7e22969d289c26a36819\",\"name\":\"Daria\"}","publishedDate":"1st Jul 2016","image":"http://res.cloudinary.com/keystone-demo/image/upload/v1467726893/og170fo2rtnmph0k8oqm.jpg","content.brief":"<p>Summer of Code has started for us today!</p>","content.extended":"<p>Summer of Code has started for us today!</p>\r\n<p>This is what we have done:</p>\r\n<ul>\r\n<li>Morning discussion about the project and brainstorming over coffee :-) We decided to create a team blog on Keystonejs in order to get to know it better from user perspective.</li>\r\n<li>Organizational call with our supervisor Sophia</li>\r\n<li>MEAN stack installation party. We installed prerequisites for KeystoneJS - Node.js, Mongo.db, Yeoman tool for running Keystone generator and got local environment for the blog up and running.</li>\r\n<li>Social media party. We spent some time on Twitter and Teams app to get to know how other teams are doing.</li>\r\n<li>Getting in touch with our mentor Max regarding the project</li>\r\n<li>Lunch and our coaching dog Zoe walk.</li>\r\n<li>Installing Keystone and getting acquainted with the project file structure. Learning some Jade templating language syntax which we will need further on.</li>\r\n<li>Sync with coaches, coaching schedule plan</li>\r\n</ul>","categories":"[{\"id\":\"577d20a79200eb4c3616268c\",\"name\":\"Daily Log\"}]"},{"id":"577d22a69200eb4c3616268e","slug":"our-day-4","title":"Our day 3","state":"Published","author":"{\"id\":\"577b7e22969d289c26a36819\",\"name\":\"Daria\"}","publishedDate":"5th Jul 2016","content.brief":"<p>The Summer of Code has barely started, and we are already learning so much interesting stuff every day.&nbsp;Little by little, we can already see promising progress.</p>","content.extended":"<p>The Summer of Code has barely started, and we are already learning so much interesting stuff every day.&nbsp;Little by little, we can already see promising progress.</p>\r\n<p>Today, we did this:<br />* Had a call with our mentor Max and our supervisor Sophia in the early morning.<br />* Discussed our project plan and settled on which issues we will be tackling first.<br />* Did a little preparation to handle the password field complexity and text field character limit issues.<br />* Visited our pre-selected coworking space - we loved it, so we made a decision to drop further appointments and stay here.<br />* Pushed to github a skeleton of our future blog which will run on Keystone.<br />* Explored the codebase with our coach Josef and tried to break stuff to see how things work.<br />* Lightly touched the unit tests issue and figured out that we need to do some reading and self study regarding react.js.</p>\r\n<p>We decided to focus on getting the blog up and running this week, so we can focus on the field validation questions once this is done.</p>\r\n<p>It has been a really busy day and we are super tired, but it was worth it and we are happy with where things are going.</p>","categories":"[{\"id\":\"577d20a79200eb4c3616268c\",\"name\":\"Daily Log\"}]"},{"id":"577bc1b5069d10512e53e8a1","slug":"rgsoc-day-2","title":"RGSoC Day 2","state":"Published","author":"{\"id\":\"577b7e22969d289c26a36819\",\"name\":\"Daria\"}","publishedDate":"4th Jul 2016","content.brief":"<p>This is what we did on day 2: We installed the latest version of Keystone, which is unstable and under development at the moment (this is the version we will be working on)....</p>","content.extended":"<p>This is what we did on day 2:</p>\r\n<ul>\r\n<li>installed the latest version of Keystone, which is unstable and under development at the moment (this is the version we will be working on)</li>\r\n<li>played around the admin interface to get acquainted with the project from the user point of view</li>\r\n<li>tackled MongoDB issue on Veronika's laptop with Ubuntu 16.04</li>\r\n<li>browsed suggested issues to work on that our mentor had sent us</li>\r\n<li>set up a team page on Trello and made it ready for use</li>\r\n<li>synced with our coaches and had a catch up with our mentor before our call tomorrow</li>\r\n<li>learned about e2e tests and ran them</li>\r\n<li>made a schedule to visit coworking places, to see which one works best for us</li>\r\n</ul>","categories":"[{\"id\":\"577d20a79200eb4c3616268c\",\"name\":\"Daily Log\"}]"}]